#include<stdio.h>

int main() {
	//使用例
	int arr[8][8] = {
   /*1  2  3  4  5  6  7  8*/
/*1*/8, 9, 9, 1, 7, 5, 5,10,
/*2*/1, 0, 7, 7, 5, 8, 6, 7,
/*3*/3, 7, 9, 2, 7, 7, 8,10,
/*4*/6, 7, 8, 5, 6, 7, 2, 1,
/*5*/9,10,10, 2, 4, 9, 7, 5,
/*6*/4, 7, 5, 6, 7, 0, 5, 0,
/*7*/5, 4, 5, 1, 3,10, 6, 0,
/*8*/0, 6, 7, 8, 7,10, 3, 5
	};
	int ps_arr[9][9] = { 0 };//行列多开一个,计算时不用写个if判断边界
	for (int i = 1; i <= 8; i++) {
		for (int j = 1; j <= 8; j++)ps_arr[i][j] = arr[i - 1][j - 1] + ps_arr[i - 1][j] + ps_arr[i][j - 1] - ps_arr[i - 1][j - 1];
	}
	printf("%d", ps_arr[5][5] - ps_arr[5][2] - ps_arr[2][5] + ps_arr[2][2]);//求(3,3)到(5,5)的矩形的和
	return 0;
}
